k6-result/get-dir-list-shock-load-test-200-vu-02.txt
PS D:\code\go\wx-example\wx-example\k6> k6 run get-dir-list-shock-load-test-200-vu-chi.js

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

WARN[0000] There were unknown fields in the options exported in the script  error="json: unknown field \"executor\""
     execution: local
        script: get-dir-list-shock-load-test-200-vu-chi.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 200 looping VUs for 30s (gracefulStop: 30s)



  █ TOTAL RESULTS

    checks_total.......................: 62362   2072.769003/s
    checks_succeeded...................: 100.00% 62362 out of 62362
    checks_failed......................: 0.00%   0 out of 62362

    ✓ status is 200

    HTTP
    http_req_duration.......................................................: avg=96.27ms min=6.93ms med=90.31ms max=433.76ms p(90)=150.32ms p(95)=174.14ms
      { expected_response:true }............................................: avg=96.27ms min=6.93ms med=90.31ms max=433.76ms p(90)=150.32ms p(95)=174.14ms
    http_req_failed.........................................................: 0.00%  0 out of 62362
    http_reqs...............................................................: 62362  2072.769003/s

    EXECUTION
    iteration_duration......................................................: avg=96.36ms min=7.47ms med=90.39ms max=433.76ms p(90)=150.43ms p(95)=174.16ms
    iterations..............................................................: 62362  2072.769003/s
    vus.....................................................................: 200    min=200        max=200    
    vus_max.................................................................: 200    min=200        max=200    

    NETWORK
    data_received...........................................................: 9.1 GB 301 MB/s
    data_sent...............................................................: 6.0 MB 201 kB/s



                                                                                                               
running (0m30.1s), 000/200 VUs, 62362 complete and 0 interrupted iterations                                    
default ✓ [======================================] 200 VUs  30s  

PS D:\code\go\wx-example\wx-example\k6> k6 run get-dir-list-shock-load-test-200-vu-wx.js 

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

WARN[0000] There were unknown fields in the options exported in the script  error="json: unknown field \"executor\""
     execution: local
        script: get-dir-list-shock-load-test-200-vu-wx.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 200 looping VUs for 30s (gracefulStop: 30s)



  █ TOTAL RESULTS

    checks_total.......................: 65817   2189.005508/s
    checks_succeeded...................: 100.00% 65817 out of 65817
    checks_failed......................: 0.00%   0 out of 65817

    ✓ status is 200

    HTTP
    http_req_duration.......................................................: avg=91.16ms min=5.54ms med=81.71ms max=666.77ms p(90)=154.85ms p(95)=183.28ms
      { expected_response:true }............................................: avg=91.16ms min=5.54ms med=81.71ms max=666.77ms p(90)=154.85ms p(95)=183.28ms
    http_req_failed.........................................................: 0.00%  0 out of 65817
    http_reqs...............................................................: 65817  2189.005508/s

    EXECUTION
    iteration_duration......................................................: avg=91.25ms min=5.54ms med=81.78ms max=682.99ms p(90)=154.9ms  p(95)=183.36ms
    iterations..............................................................: 65817  2189.005508/s
    vus.....................................................................: 200    min=200        max=200    
    vus_max.................................................................: 200    min=200        max=200    

    NETWORK
    data_received...........................................................: 9.6 GB 318 MB/s
    data_sent...............................................................: 6.4 MB 212 kB/s



                                                                                                               
running (0m30.1s), 000/200 VUs, 65817 complete and 0 interrupted iterations                                    
default ✓ [======================================] 200 VUs  30s